[
  {
    "Date": 1989,
    "Event": "Berner’s Le invented WWW",
    "paragraph1": "Tim Berners-Lee, a British scientist, invented the World Wide Web (WWW) in 1989, while working at CERN. The Web was originally conceived and developed to meet the demand for automated information-sharing between scientists in universities and institutes around the world.",
    "paragraph2": "CERN is not an isolated laboratory, but rather the focal point for an extensive community that includes more than 17 000 scientists from over 100 countries. Although they typically spend some time on the CERN site, the scientists usually work at universities and national laboratories in their home countries. Reliable communication tools are therefore essential.",
    "source": "https://home.cern/science/computing/birth-web/short-history-web"
  },
  {
    "Date": 1990,
    "Event": "HTML developed",
    "paragraph1": "HTML is the language that powers the Web in many respects, as the lingua franca that Web browsers are expected to be able to render. HTML has had unprecedented levels of success, and the uptake is all the more surprising when you realise that it was only invented in 1990, and few people knew about it before 1993.",
    "paragraph2": "In fact, although HTML has changed relatively little since those early days, the history of HTML is rather cloudy. However, with a little detective work on the Web, it is possible to reconstruct most of the events that led to the creation and subsequent deployment and acceptance of HTML.",
    "source": "http://infomesh.net/html/history/early/"
  },
  {
    "Date": 1991,
    "Event": " First website Launched",
    "paragraph1": "There are millions of web pages now, but none of them existed 20 years ago.The first web page went live on August 6, 1991.  It was dedicated to information on the World Wide Web project and was made by Tim Berners-Lee. It ran on a NeXT computer at the European Organization for Nuclear Research, CERN.",
    "source": "https://www.businessinsider.com/flashback-this-is-what-the-first-website-ever-looked-like-2011-6?r=US&IR=T"
  },
  {
    "Date": 1995,
    "Event": "JS developed",
    "paragraph1": "Brendan Eich, a Netscape Communications Corporation programmer, created JavaScript in September 1995. It took Eich only 10 days to develop the scripting language, then known as Mocha.Let’s step back to look at this complex JavaScript history.",
    "paragraph2": "Today, JavaScript is still everywhere – it’s the most commonly used client-side scripting language. JavaScript is written into HTML documents and enables interactions with web pages in many unique ways. For example, thanks to JavaScript we can automatically schedule appointments and play online games. Furthermore, new developments, such as Node.js, allow the use of JavaScript on server-side while APIs, such as HTML5, allow the control of user media and other device features.",
    "source": "https://www.checkmarx.com/blog/javascript-history-infographic/"
  },
  {
    "Date": 1996,
    "Event": "CSS & JS released",
    "paragraph1": "(JScript was first released in 1996, alongside initial support for CSS and extensions to HTML. Each of these implementations was noticeably different from their counterparts in Navigator. These differences made it difficult for developers to make their websites work well in both browsers, leading to widespread use of 'best viewed in Netscape' and 'best viewed in Internet Explorer' logos for several years.)",
    "source": "https://en.wikipedia.org/wiki/JavaScript"
  },
  {
    "Date": 1998,
    "Event": "Google officially launched",
    "paragraph1": "Late 1990s. Originally the search engine used Stanford's website with the domains google.stanford.edu and z.stanford.edu. The domain google.com was registered on September 15, 1997. They formally incorporated their company, Google, on September 4, 1998 in their friend Susan Wojcicki's garage in Menlo Park, California.",
    "source": "https://en.wikipedia.org/wiki/Google"
  },
  {
    "Date": 2001,
    "Event": "Internet on phone",
    "paragraph1": "Believe it or not mobile website technology first started to emerge around 1997. At the time the Nokia 9000 Communicator smartphone was perhaps the only reasonably useful device to access the internet through a LCD display. In 2001 Ericsson created the T68 smartphone with the first color display and simple web browser.",
    "paragraph2": "Early smartphone with web capability continued with the PalmOne Treo, BlackBerry 6210 & 7210 in 2003. The Sony Ericsson P910 was released in 2004, and the first 3G phone was the Nokia 6680 in 2005.",
    "source": "http://www.jwag.biz/newsletters/2013/03/12/a-short-history-of-the-mobile-internet.html"
  },
  {
    "Date": 2007,
    "Event": "First Mobile browser",
    "paragraph1": "The mobile web refers to browser-based World Wide Web services accessed from handheld ... The shift to mobile web access has accelerated since 2007 with the rise of larger ... The first commercial launch of a mobile-specific browser-based web service was in 1999 in Japan when i-mode was launched by NTT DoCoMo.",
    "source": "https://en.wikipedia.org/wiki/Mobile_web"
  },
  {
    "Date": 2010,
    "Event": "Concept of Responsive Web design",
    "paragraph1": "Coined by Ethan Marcotte in May 2010, responsive web design (RWD) is idea that “[website] design and development should respond to the user’s behavior and environment based on screen size, platform and orientation” (Smashing Magazine).",
    "source": "https://exsite.ie/history-of-responsive-web-design/"
  }
]
